zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K322_DCM_GPR.h
#define DCM_GPR_DCMRWD6_FLEXCAN0_DBG_DIS_CM7_0_MASK (0x1000000U)
#define DCM_GPR_DCMRWD6_FLEXCAN0_DBG_DIS_CM7_0_SHIFT (24U)
#define DCM_GPR_DCMRWD6_FLEXCAN0_DBG_DIS_CM7_0_WIDTH (1U)
#define DCM_GPR_DCMRWD6_FLEXCAN0_DBG_DIS_CM7_0(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD6_FLEXCAN0_DBG_DIS_CM7_0_SHIFT)) & DCM_GPR_DCMRWD6_FLEXCAN0_DBG_DIS_CM7_0_MASK)

#define DCM_GPR_DCMRWD6_FLEXCAN1_DBG_DIS_CM7_0_MASK (0x2000000U)
#define DCM_GPR_DCMRWD6_FLEXCAN1_DBG_DIS_CM7_0_SHIFT (25U)
#define DCM_GPR_DCMRWD6_FLEXCAN1_DBG_DIS_CM7_0_WIDTH (1U)
#define DCM_GPR_DCMRWD6_FLEXCAN1_DBG_DIS_CM7_0(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD6_FLEXCAN1_DBG_DIS_CM7_0_SHIFT)) & DCM_GPR_DCMRWD6_FLEXCAN1_DBG_DIS_CM7_0_MASK)

#define DCM_GPR_DCMRWD6_FLEXCAN2_DBG_DIS_CM7_0_MASK (0x4000000U)
#define DCM_GPR_DCMRWD6_FLEXCAN2_DBG_DIS_CM7_0_SHIFT (26U)
#define DCM_GPR_DCMRWD6_FLEXCAN2_DBG_DIS_CM7_0_WIDTH (1U)
#define DCM_GPR_DCMRWD6_FLEXCAN2_DBG_DIS_CM7_0(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD6_FLEXCAN2_DBG_DIS_CM7_0_SHIFT)) & DCM_GPR_DCMRWD6_FLEXCAN2_DBG_DIS_CM7_0_MASK)

#define DCM_GPR_DCMRWD6_FLEXCAN3_DBG_DIS_CM7_0_MASK (0x8000000U)
#define DCM_GPR_DCMRWD6_FLEXCAN3_DBG_DIS_CM7_0_SHIFT (27U)
#define DCM_GPR_DCMRWD6_FLEXCAN3_DBG_DIS_CM7_0_WIDTH (1U)
#define DCM_GPR_DCMRWD6_FLEXCAN3_DBG_DIS_CM7_0(x) (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD6_FLEXCAN3_DBG_DIS_CM7_0_SHIFT)) & DCM_GPR_DCMRWD6_FLEXCAN3_DBG_DIS_CM7_0_MASK)

#define DCM_GPR_DCMRWD6_SAI0_DBG_DIS_CM7_0_MASK  (0x40000000U)
#define DCM_GPR_DCMRWD6_SAI0_DBG_DIS_CM7_0_SHIFT (30U)
#define DCM_GPR_DCMRWD6_SAI0_DBG_DIS_CM7_0_WIDTH (1U)
#define DCM_GPR_DCMRWD6_SAI0_DBG_DIS_CM7_0(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD6_SAI0_DBG_DIS_CM7_0_SHIFT)) & DCM_GPR_DCMRWD6_SAI0_DBG_DIS_CM7_0_MASK)

#define DCM_GPR_DCMRWD6_SAI1_DBG_DIS_CM7_0_MASK  (0x80000000U)
#define DCM_GPR_DCMRWD6_SAI1_DBG_DIS_CM7_0_SHIFT (31U)
#define DCM_GPR_DCMRWD6_SAI1_DBG_DIS_CM7_0_WIDTH (1U)
#define DCM_GPR_DCMRWD6_SAI1_DBG_DIS_CM7_0(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD6_SAI1_DBG_DIS_CM7_0_SHIFT)) & DCM_GPR_DCMRWD6_SAI1_DBG_DIS_CM7_0_MASK)
/*! @} */

/*! @name DCMRWD8 - Read Write GPR On Destructive Reset 8 */
/*! @{ */

#define DCM_GPR_DCMRWD8_EDMA_DBG_DIS_CM7_1_MASK  (0x1U)
#define DCM_GPR_DCMRWD8_EDMA_DBG_DIS_CM7_1_SHIFT (0U)
#define DCM_GPR_DCMRWD8_EDMA_DBG_DIS_CM7_1_WIDTH (1U)
#define DCM_GPR_DCMRWD8_EDMA_DBG_DIS_CM7_1(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_EDMA_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_EDMA_DBG_DIS_CM7_1_MASK)

#define DCM_GPR_DCMRWD8_FCCU_DBG_DIS_CM7_1_MASK  (0x2U)
#define DCM_GPR_DCMRWD8_FCCU_DBG_DIS_CM7_1_SHIFT (1U)
#define DCM_GPR_DCMRWD8_FCCU_DBG_DIS_CM7_1_WIDTH (1U)
#define DCM_GPR_DCMRWD8_FCCU_DBG_DIS_CM7_1(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_FCCU_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_FCCU_DBG_DIS_CM7_1_MASK)

#define DCM_GPR_DCMRWD8_LCU0_DBG_DIS_CM7_1_MASK  (0x4U)
#define DCM_GPR_DCMRWD8_LCU0_DBG_DIS_CM7_1_SHIFT (2U)
#define DCM_GPR_DCMRWD8_LCU0_DBG_DIS_CM7_1_WIDTH (1U)
#define DCM_GPR_DCMRWD8_LCU0_DBG_DIS_CM7_1(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_LCU0_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_LCU0_DBG_DIS_CM7_1_MASK)

#define DCM_GPR_DCMRWD8_LCU1_DBG_DIS_CM7_1_MASK  (0x8U)
#define DCM_GPR_DCMRWD8_LCU1_DBG_DIS_CM7_1_SHIFT (3U)
#define DCM_GPR_DCMRWD8_LCU1_DBG_DIS_CM7_1_WIDTH (1U)
#define DCM_GPR_DCMRWD8_LCU1_DBG_DIS_CM7_1(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_LCU1_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_LCU1_DBG_DIS_CM7_1_MASK)

#define DCM_GPR_DCMRWD8_EMIOS0_DBG_DIS_CM7_1_MASK (0x10U)
#define DCM_GPR_DCMRWD8_EMIOS0_DBG_DIS_CM7_1_SHIFT (4U)
#define DCM_GPR_DCMRWD8_EMIOS0_DBG_DIS_CM7_1_WIDTH (1U)
#define DCM_GPR_DCMRWD8_EMIOS0_DBG_DIS_CM7_1(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_EMIOS0_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_EMIOS0_DBG_DIS_CM7_1_MASK)

#define DCM_GPR_DCMRWD8_EMIOS1_DBG_DIS_CM7_1_MASK (0x20U)
#define DCM_GPR_DCMRWD8_EMIOS1_DBG_DIS_CM7_1_SHIFT (5U)
#define DCM_GPR_DCMRWD8_EMIOS1_DBG_DIS_CM7_1_WIDTH (1U)
#define DCM_GPR_DCMRWD8_EMIOS1_DBG_DIS_CM7_1(x)  (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_EMIOS1_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_EMIOS1_DBG_DIS_CM7_1_MASK)

#define DCM_GPR_DCMRWD8_RTC_DBG_DIS_CM7_1_MASK   (0x80U)
#define DCM_GPR_DCMRWD8_RTC_DBG_DIS_CM7_1_SHIFT  (7U)
#define DCM_GPR_DCMRWD8_RTC_DBG_DIS_CM7_1_WIDTH  (1U)
#define DCM_GPR_DCMRWD8_RTC_DBG_DIS_CM7_1(x)     (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_RTC_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_RTC_DBG_DIS_CM7_1_MASK)

#define DCM_GPR_DCMRWD8_SWT0_DBG_DIS_CM7_1_MASK  (0x100U)
#define DCM_GPR_DCMRWD8_SWT0_DBG_DIS_CM7_1_SHIFT (8U)
#define DCM_GPR_DCMRWD8_SWT0_DBG_DIS_CM7_1_WIDTH (1U)
#define DCM_GPR_DCMRWD8_SWT0_DBG_DIS_CM7_1(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_SWT0_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_SWT0_DBG_DIS_CM7_1_MASK)

#define DCM_GPR_DCMRWD8_SWT1_DBG_DIS_CM7_1_MASK  (0x200U)
#define DCM_GPR_DCMRWD8_SWT1_DBG_DIS_CM7_1_SHIFT (9U)
#define DCM_GPR_DCMRWD8_SWT1_DBG_DIS_CM7_1_WIDTH (1U)
#define DCM_GPR_DCMRWD8_SWT1_DBG_DIS_CM7_1(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_SWT1_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_SWT1_DBG_DIS_CM7_1_MASK)

#define DCM_GPR_DCMRWD8_STM0_DBG_DIS_CM7_1_MASK  (0x400U)
#define DCM_GPR_DCMRWD8_STM0_DBG_DIS_CM7_1_SHIFT (10U)
#define DCM_GPR_DCMRWD8_STM0_DBG_DIS_CM7_1_WIDTH (1U)
#define DCM_GPR_DCMRWD8_STM0_DBG_DIS_CM7_1(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_STM0_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_STM0_DBG_DIS_CM7_1_MASK)

#define DCM_GPR_DCMRWD8_STM1_DBG_DIS_CM7_1_MASK  (0x800U)
#define DCM_GPR_DCMRWD8_STM1_DBG_DIS_CM7_1_SHIFT (11U)
#define DCM_GPR_DCMRWD8_STM1_DBG_DIS_CM7_1_WIDTH (1U)
#define DCM_GPR_DCMRWD8_STM1_DBG_DIS_CM7_1(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_STM1_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_STM1_DBG_DIS_CM7_1_MASK)

#define DCM_GPR_DCMRWD8_PIT0_DBG_DIS_CM7_1_MASK  (0x1000U)
#define DCM_GPR_DCMRWD8_PIT0_DBG_DIS_CM7_1_SHIFT (12U)
#define DCM_GPR_DCMRWD8_PIT0_DBG_DIS_CM7_1_WIDTH (1U)
#define DCM_GPR_DCMRWD8_PIT0_DBG_DIS_CM7_1(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_PIT0_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_PIT0_DBG_DIS_CM7_1_MASK)

#define DCM_GPR_DCMRWD8_PIT1_DBG_DIS_CM7_1_MASK  (0x2000U)
#define DCM_GPR_DCMRWD8_PIT1_DBG_DIS_CM7_1_SHIFT (13U)
#define DCM_GPR_DCMRWD8_PIT1_DBG_DIS_CM7_1_WIDTH (1U)
#define DCM_GPR_DCMRWD8_PIT1_DBG_DIS_CM7_1(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_PIT1_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_PIT1_DBG_DIS_CM7_1_MASK)

#define DCM_GPR_DCMRWD8_PIT2_DBG_DIS_CM7_1_MASK  (0x4000U)
#define DCM_GPR_DCMRWD8_PIT2_DBG_DIS_CM7_1_SHIFT (14U)
#define DCM_GPR_DCMRWD8_PIT2_DBG_DIS_CM7_1_WIDTH (1U)
#define DCM_GPR_DCMRWD8_PIT2_DBG_DIS_CM7_1(x)    (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMRWD8_PIT2_DBG_DIS_CM7_1_SHIFT)) & DCM_GPR_DCMRWD8_PIT2_DBG_DIS_CM7_1_MASK)

